import estates.ManufactureFactory;
import persons.MrSprouts;
import product.ProductTypeEnum;
import estates.Latifundia;
import persons.*;

public class Main {
    public static void main(String[] args) {
        MrSprouts mrSprouts = new MrSprouts();
        mrSprouts.manage();
    }
}

/*
    Господин Спрутс был владельцем огромной мануфактурной фабрики,
    известной под названием Спрутсовской мануфактуры, выпускавшей
    несметные количества самых разнообразных тканей. Кроме того,
    у него было около тридцати сахарных заводов и несколько
    латифундий, то есть громаднейших земельных участков.
    На всех этих земельных участках работали тысячи коротышек,
    которые выращивали хлопок для Спрутсовской мануфактуры,
    сахарную свеклу для его сахарных заводов, а также огромные
    количества лунной ржи и пшеницы, которыми господин Спрутс
    вел большую торговлю.
*/